openfoam_f1_case/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (50.0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (50.0 0 0);
    }
    
    outlet
    {
        type            zeroGradient;
    }
    
    ground
    {
        type            fixedValue;
        value           uniform (50.0 0 0);  // Moving ground
    }
    
    top
    {
        type            slip;
    }
    
    sides
    {
        type            slip;
    }
    
    car
    {
        type            noSlip;
    }
}
