openfoam_f1_case/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    (-10 -5 0)  // 0
    (25 -5 0)  // 1
    (25 5 0)  // 2
    (-10 5 0)  // 3
    (-10 -5 8)  // 4
    (25 -5 8)  // 5
    (25 5 8)  // 6
    (-10 5 8)  // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (70 20 16) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    ground
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    top
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    sides
    {
        type patch;
        faces
        (
            (0 1 5 4)
            (3 7 6 2)
        );
    }
);
