openfoam_f1_case/system/snappyHexMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

castellatedMesh true;
snap            true;
addLayers       true;

geometry
{
    car.stl
    {
        type triSurfaceMesh;
        name car;
    }
    
    refinementBox
    {
        type searchableBox;
        min (-2 -1.5 0);
        max (8 1.5 2);
    }
    
    wakeBox
    {
        type searchableBox;
        min (5 -1 0);
        max (15 1 1.5);
    }
}

castellatedMeshControls
{
    maxLocalCells 100000000;
    maxGlobalCells 200000000;
    minRefinementCells 10;
    maxLoadUnbalance 0.10;
    nCellsBetweenLevels 3;
    
    features
    (
        {
            file "car.eMesh";
            level 6;
        }
    );
    
    refinementSurfaces
    {
        car
        {
            level (5 6);
            patchInfo
            {
                type wall;
            }
        }
    }
    
    resolveFeatureAngle 30;
    
    refinementRegions
    {
        refinementBox
        {
            mode inside;
            levels ((1E15 4));
        }
        wakeBox
        {
            mode inside;
            levels ((1E15 3));
        }
    }
    
    locationInMesh (2.5 0 1.5);
    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch 3;
    tolerance 2.0;
    nSolveIter 100;
    nRelaxIter 5;
    nFeatureSnapIter 10;
    implicitFeatureSnap false;
    explicitFeatureSnap true;
    multiRegionFeatureSnap false;
}

addLayersControls
{
    relativeSizes true;
    
    layers
    {
        car
        {
            nSurfaceLayers 5;
        }
        ground
        {
            nSurfaceLayers 3;
        }
    }
    
    expansionRatio 1.2;
    finalLayerThickness 0.5;
    minThickness 0.001;
    nGrow 0;
    featureAngle 180;
    nRelaxIter 5;
    nSmoothSurfaceNormals 1;
    nSmoothNormals 3;
    nSmoothThickness 10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedialAxisAngle 90;
    nBufferCellsNoExtrude 0;
    nLayerIter 50;
    nRelaxedIter 20;
}

meshQualityControls
{
    maxNonOrtho 65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave 80;
    minVol 1e-13;
    minTetQuality 1e-15;
    minArea -1;
    minTwist 0.02;
    minDeterminant 0.001;
    minFaceWeight 0.05;
    minVolRatio 0.01;
    minTriangleTwist -1;
    nSmoothScale 4;
    errorReduction 0.75;
}

writeFlags
(
    scalarLevels
    layerSets
    layerFields
);

mergeTolerance 1e-6;
